# Selecting rows/observations
Selecting rows (or observations) in Python is a common operation when working with tabular data, such as that stored in a Pandas DataFrame. Pandas provides powerful and flexible methods to filter and select rows based on specific conditions.

1. Basic Selection
Use the .loc[] or .iloc[] methods or direct slicing.

- Using Index Labels with .loc[]: .loc[] is label-based selection.

In [26]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40]}
df = pd.DataFrame(data)

# Select row with index label 1
print(df.loc[1])  # Output: Row with Bob's details

Name    Bob
Age      30
Name: 1, dtype: object

- Using Integer Indices with .iloc[]: .iloc[] is integer-based selection.

In [15]:
# Select the second row
print(df.iloc[1])  # Output: Row with Bob's details

Name    Bob
Age      30
Name: 1, dtype: object

- Slicing Rows: You can slice rows using labels or indices.

In [16]:
# Slicing rows by index
print(df[1:3])  # Outputs rows with indices 1 and 2 (Bob and Charlie)

      Name  Age
1      Bob   30
2  Charlie   35

2. Conditional Selection: Select rows based on a condition.

In [17]:
# Select rows where Age > 30
print(df[df['Age'] > 30])

      Name  Age
2  Charlie   35
3    David   40

3. Selecting Rows with Multiple Conditions

Combine conditions using & (and), | (or), and ~ (not).

In [18]:
# Select rows where Age > 30 and Name is not 'David'
print(df[(df['Age'] > 30) & (df['Name'] != 'David')])

      Name  Age
2  Charlie   35

4. Using Query Method

A cleaner syntax for complex conditions.

In [19]:
# Using query to filter rows
print(df.query("Age > 30 and Name != 'David'"))

      Name  Age
2  Charlie   35

5. Selecting Rows by Index Position

Use .iloc[] or .iloc[start:stop].

In [20]:
# Select first two rows
print(df.iloc[:2])

    Name  Age
0  Alice   25
1    Bob   30

6. Selecting Rows by Specific Index

Set an index and select by it.

In [27]:
df1= df.copy()
df1.set_index('Name', inplace=True)
# Select row with index 'Alice'
print(df1.loc['Alice'])

Age    25
Name: Alice, dtype: int64

7. Selecting Rows with .isin()

Use .isin() to filter based on multiple values.

In [28]:
# Select rows where Name is Alice or David
print(df[df['Name'].isin(['Alice', 'David'])])

    Name  Age
0  Alice   25
3  David   40

8. Dropping Rows

Drop rows to exclude them from the DataFrame.

In [30]:
# Drop row with index 1
print(df.drop(index=1))

      Name  Age
0    Alice   25
2  Charlie   35
3    David   40

9. Random Row Selection

Use .sample() to randomly select rows.

In [31]:
# Randomly select 2 rows
print(df.sample(2))

      Name  Age
1      Bob   30
2  Charlie   35

10. Selecting Rows Using lambda

Use a lambda function for complex logic.

In [32]:
# Select rows where the length of the Name is greater than 3
print(df[df['Name'].apply(lambda x: len(x) > 3)])

      Name  Age
0    Alice   25
2  Charlie   35
3    David   40

# Rounding Number
Rounding numbers in Python involves reducing a number to a specified level of precision, typically to a certain number of decimal places or to the nearest integer. Python provides built-in functions and operators to handle rounding effectively.

### Use Cases
- Data formatting: Displaying numerical values in a readable format.
- Mathematical computations: Ensuring accuracy and consistency.
- Financial calculations: Precise control over rounding methods

### Methods for Rounding Numbers in Python
1. round() Function

    - The round() function is the simplest way to round numbers in Python.
    - Syntax: round(number, ndigits)
        - number: The number you want to round.
        - ndigits: The number of decimal places to round to (optional). If omitted, it defaults to 0, rounding to the nearest integer.

In [33]:
print(round(3.14159, 2))  # Output: 3.14
print(round(2.718, 0))    # Output: 3.0
print(round(1.25, 1))     # Output: 1.2

3.14
3.0
1.2

2. Rounding Using math.floor() and math.ceil()
- math.floor(): Rounds a number down to the nearest integer.
- math.ceil(): Rounds a number up to the nearest integer.

In [34]:
import math
print(math.floor(3.7))  # Output: 3
print(math.ceil(3.2))   # Output: 4

3
4

3. Rounding Towards Zero Using math.trunc()
- The math.trunc() function truncates the decimal part and returns the integer part of a number.
- It always rounds towards zero.

In [35]:
print(math.trunc(3.7))   # Output: 3
print(math.trunc(-3.7))  # Output: -3

3
-3

4. Decimal Module for Precise Rounding
- The decimal module provides finer control over rounding and precision, particularly useful in financial applications.
- You can specify rounding rules like ROUND_HALF_UP, ROUND_HALF_DOWN, etc

In [36]:
from decimal import Decimal, ROUND_HALF_UP
number = Decimal('2.675')
rounded_number = number.quantize(Decimal('0.01'), rounding=ROUND_HALF_UP)
print(rounded_number)  # Output: 2.68

2.68

5. Rounding to Nearest Multiple
- You can use simple arithmetic to round to the nearest multiple of a number.

In [37]:
def round_to_nearest(x, base):
    return base * round(x / base)

print(round_to_nearest(37, 5))  # Output: 35

35

### Rounding Behavior
Python's round() function implements round half to even (also known as bankers' rounding). This means:
- If a number is exactly halfway between two others, it rounds to the nearest even number.

In [38]:
print(round(2.5))  # Output: 2
print(round(3.5))  # Output: 4

2
4

# Selecting columns/fields
### Common Use Cases
- Data Cleaning: Selecting specific columns to drop irrelevant ones.
- Feature Engineering: Selecting columns for model input in machine learning.
- Exploratory Data Analysis: Focusing on specific attributes of the data.

1. Using Pandas DataFrame

Pandas is the go-to library for working with tabular data. Below are common methods to select columns:

a. Selecting a Single Column

You can select a column by using the column name as a string within square brackets []:

In [39]:
import pandas as pd

# Example DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['NY', 'LA', 'SF']}
df = pd.DataFrame(data)

# Select a single column
age_column = df['Age']
print(age_column)

0    25
1    30
2    35
Name: Age, dtype: int64

b. Selecting Multiple Columns

To select multiple columns, pass a list of column names:

In [40]:
# Select multiple columns
subset = df[['Name', 'City']]
print(subset)

      Name City
0    Alice   NY
1      Bob   LA
2  Charlie   SF

c. Using Dot Notation

For columns with simple, valid Python identifiers (e.g., no spaces or special characters), you can use dot notation:

In [41]:
# Dot notation
name_column = df.Name
print(name_column)

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

2. Using Conditions to Select Columns

You can dynamically select columns based on conditions:

In [42]:
# Select columns with names starting with 'C'
selected_columns = df.loc[:, df.columns.str.startswith('C')]
print(selected_columns)

  City
0   NY
1   LA
2   SF

3. Using .iloc and .loc

a. .iloc (Index-based selection)

Allows selection by column index:

In [43]:
# Select the first column
first_column = df.iloc[:, 0]
print(first_column)

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

b. .loc (Label-based selection)

Allows selection by column names:

In [44]:
# Select columns by name
selected_columns = df.loc[:, ['Age', 'City']]
print(selected_columns)

   Age City
0   25   NY
1   30   LA
2   35   SF

4. Using Libraries like NumPy

If youâ€™re working with arrays (from NumPy):

In [45]:
import numpy as np

# Example data
data = np.array([[25, 'NY'], [30, 'LA'], [35, 'SF']])
columns = ['Age', 'City']

# Select a column
age_column = data[:, 0]  # Select the first column
print(age_column)

['25' '30' '35']

# Merging data
### Merging in pandas
The pandas library offers the merge() function, which provides SQL-like joins for DataFrames.

Syntax:

`pandas.merge(left, right, how='inner', on=None, left_on=None, right_on=None)`

#### Parameters
- left: The first DataFrame.
- right: The second DataFrame.
- how: Type of merge to be performed ('left', 'right', 'inner', 'outer'). Default is 'inner'.
- on: Column or index level to join on (common to both DataFrames).
- left_on / right_on: Specify the column(s) from left and right DataFrames if they have different column names.
- suffixes: Suffixes for overlapping column names ('_x', '_y' by default).

#### Types of Merges
1. Inner Join: Returns rows with matching keys in both DataFrames

In [58]:
data1 = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
data2 = {'Name': ['Alice', 'Bob', 'Alex'],'City': ['NY', 'LA', 'SF']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [59]:
df2

    Name City
0  Alice   NY
1    Bob   LA
2   Alex   SF

In [54]:
merged = pd.merge(df1, df2, how='inner', on='Name')
merged

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA

2. Left Join: All rows from the left DataFrame and matching rows from the right

In [55]:
merged = pd.merge(df1, df2, how='left', on='Name')
merged

      Name  Age City
0    Alice   25   NY
1      Bob   30   LA
2  Charlie   35  NaN

3. Right Join: All rows from the right DataFrame and matching rows from the left

In [57]:
merged = pd.merge(df1, df2, how='right', on='Name')
merged

    Name   Age City
0  Alice  25.0   NY
1    Bob  30.0   LA
2   Alex   NaN   SF

4. Outer Join: All rows from both DataFrames, with missing values filled as NaN.

In [61]:
merged = pd.merge(df1, df2, how='outer', on='Name')
merged

      Name   Age City
0     Alex   NaN   SF
1    Alice  25.0   NY
2      Bob  30.0   LA
3  Charlie  35.0  NaN

### Other Methods for Merging Data
1. concat(): Stacks DataFrames vertically or horizontally

In [62]:
pd.concat([df1, df2], axis=0)

      Name   Age City
0    Alice  25.0  NaN
1      Bob  30.0  NaN
2  Charlie  35.0  NaN
0    Alice   NaN   NY
1      Bob   NaN   LA
2     Alex   NaN   SF

2. SQL-style Joins with pandasql or sqlite3:
- Execute SQL-like queries directly on DataFrames for more complex operations.

# Data aggregation 
Data aggregation in Python refers to the process of summarizing or combining data from multiple records into a single, meaningful representation. This is a crucial step in data analysis and data processing, especially when working with large datasets.

#### Common Use Cases for Data Aggregation:
- Summarizing data: Calculating averages, sums, or counts.
- Grouping data: Aggregating data based on specific categories or groups.
- Transforming data: Creating new metrics or features from raw data.

#### Libraries for Data Aggregation in Python:
1. Pandas:
The pandas library provides powerful tools for data aggregation, especially through the groupby() function.

Example of Aggregation with Pandas:

In [65]:
import pandas as pd

# Sample data
data = {'Category': ['A', 'B', 'A', 'B', 'C'],
        'Values': [10, 20, 15, 25, 30]}

df = pd.DataFrame(data)

# Grouping and aggregating
aggregated = df.groupby('Category').agg({
    'Values': ['sum', 'mean', 'count']
})
print(aggregated)

         Values
            sum  mean count
Category
A            25  12.5     2
B            45  22.5     2
C            30  30.0     1

2. NumPy:
The numpy library can also perform aggregations like sum, mean, min, max, etc.

Example with NumPy:

In [66]:
import numpy as np

data = np.array([10, 20, 15, 25, 30])

# Aggregations
print("Sum:", np.sum(data))
print("Mean:", np.mean(data))
print("Max:", np.max(data))

Sum: 100
Mean: 20.0
Max: 30

#### Aggregation Methods:
- sum(): Calculate the sum of values.
- mean(): Calculate the average.
- count(): Count occurrences.
- min()/max(): Find the smallest/largest value.
- std(): Calculate the standard deviation.

#### Custom Aggregations:
You can create custom aggregation functions using apply() in Pandas.

In [69]:
# Custom aggregation
custom_agg = df.groupby('Category').apply(lambda x: x['Values'].sum() * 2)
print(custom_agg)

Category
A    50
B    90
C    60
dtype: int64

C:\Users\vella\AppData\Local\Temp\ipykernel_24252\2524277501.py:2: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  custom_agg = df.groupby('Category').apply(lambda x: x['Values'].sum() * 2)

# Data munging techniques
Data munging, also known as data wrangling, involves transforming and preparing raw data into a format suitable for analysis. It includes cleaning, reshaping, and organizing data to improve its usability. Python provides various libraries and techniques to perform data munging effectively.

### Key Data Munging Techniques in Python
1. Data Cleaning
* Handling Missing Values

    - pandas.DataFrame.fillna(): Replace missing values with a specific value.
    - pandas.DataFrame.dropna(): Remove rows or columns with missing data.

In [71]:
import pandas as pd
df = pd.DataFrame({'A': [1, None, 3], 'B': [4, 5, None]})
df.fillna(0, inplace=True)  # Replace NaN with 0
df

     A    B
0  1.0  4.0
1  0.0  5.0
2  3.0  0.0

* Removing Duplicates
    - pandas.DataFrame.drop_duplicates(): Eliminate duplicate rows.

In [76]:
df.drop_duplicates(inplace=True)
df

     A    B
0  1.0  4.0
1  0.0  5.0
2  3.0  0.0

* Standardizing Data Formats
    - Convert strings to lowercase using .str.lower().
    - Standardize date formats using pandas.to_datetime().

2. Data Transformation
* Scaling and Normalization
    - Use sklearn.preprocessing.StandardScaler for standard scaling.
    - Use MinMaxScaler for normalization.

In [73]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaled_data = scaler.fit_transform(df[['A', 'B']])
scaled_data

* Encoding Categorical Variables
    - pandas.get_dummies() for one-hot encoding.
    - sklearn.preprocessing.LabelEncoder for label encoding.

In [77]:
df = pd.get_dummies(df, columns=['A'])
df

     B  A_0.0  A_1.0  A_3.0
0  4.0  False   True  False
1  5.0   True  False  False
2  0.0  False  False   True

* Log Transformation
    - Use numpy.log() to reduce skewness in data distributions.

3. Data Reshaping
* Pivot Tables
    - Use pandas.pivot_table() to reorganize data.
* Merging and Joining
    - Combine datasets using pandas.merge() or pandas.concat().
* Reshaping with Melt
    - Use pandas.melt() to unpivot tables.

4. Handling Outliers
* Statistical Methods
    - Use Z-score or IQR (Interquartile Range) to detect outliers.
* Visualization
    - Use boxplots (seaborn.boxplot) to visually identify outliers.
* Capping or Removing
    - Replace outliers with thresholds or remove them.

5. Feature Engineering
* Creating New Features
    - Derive new features from existing ones (e.g., extracting the year from a date).
* Feature Selection
    - Use methods like correlation analysis or Recursive Feature Elimination (RFE) to choose important features.

6. Data Type Conversion
* Convert data types for optimization using .astype()

In [78]:
df['B'] = df['B'].astype('int')
df

   B  A_0.0  A_1.0  A_3.0
0  4  False   True  False
1  5   True  False  False
2  0  False  False   True

### Example Workflow

In [79]:
import pandas as pd
import numpy as np

# Load data
df = pd.DataFrame({'A': [1, 2, np.nan, 4], 'B': ['X', 'Y', 'X', None], 'C': [1, 1, 2, 2]})

# Handle missing values
df['A'].fillna(df['A'].mean(), inplace=True)
df['B'].fillna('Unknown', inplace=True)

# One-hot encoding
df = pd.get_dummies(df, columns=['B'])

# Remove duplicates
df.drop_duplicates(inplace=True)

# Reshape data
df_melted = pd.melt(df, id_vars=['C'], value_vars=['A'])

print(df)
print(df_melted)

          A  C  B_Unknown    B_X    B_Y
0  1.000000  1      False   True  False
1  2.000000  1      False  False   True
2  2.333333  2      False   True  False
3  4.000000  2       True  False  False
   C variable     value
0  1        A  1.000000
1  1        A  2.000000
2  2        A  2.333333
3  2        A  4.000000

C:\Users\vella\AppData\Local\Temp\ipykernel_24252\1018407934.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(df['A'].mean(), inplace=True)
C:\Users\vella\AppData\Local\Temp\ipykernel_24252\1018407934.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['B'].fillna('Unknown', inplace=True)